<a id="0"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Assignment  22: Pandas Basics - Abhishek Waghchaure</p>

<a id="1"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 1</p>

## Question 1: Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
---

In [11]:
import pandas as pd

In [12]:
list = [4,8,15,16,23,42]
type(list)

list

In [13]:
series = pd.Series(list)
type(series)

pandas.core.series.Series

In [14]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<a id="2"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 2</p>

## Question 2: Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
---

In [15]:
list2 = [i^2 for i in range (10)]

In [17]:
print(list2)
print(type(list2))

[2, 3, 0, 1, 6, 7, 4, 5, 10, 11]
<class 'list'>

In [19]:
series2 = pd.Series(list2)
print(series2)
print(type(series2))

0     2
1     3
2     0
3     1
4     6
5     7
6     4
7     5
8    10
9    11
dtype: int64
<class 'pandas.core.series.Series'>

<a id="3"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 3</p>

## Question 3: Create a Pandas DataFrame that contains the following data:

|Name  |Age  |Gender|
|:----:|:---:|:----:|
|Alice |25   |Female|
|Bob   |30   |Male  |
|Claire|27   |Female|

## Then Print the DataFrame

---

In [21]:
dict1 = {
    'Name' : ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}

In [22]:
df = pd.DataFrame(dict1)

In [23]:
print(df)
print(type(df))

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
<class 'pandas.core.frame.DataFrame'>

In [25]:
dict2 = [['Alice','Bob','Claire'],
         [25,30,27],
         ['Female','Male','Female']
]

In [28]:
df2 = pd.DataFrame(dict2, columns = ['Name','Age','Gender'])

In [29]:
print(df2)

     Name   Age  Gender
0   Alice   Bob  Claire
1      25    30      27
2  Female  Male  Female

<a id="4"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 4</p>

## Question 4: What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
---

## Answer:

### A DataFrame in pandas is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table, where data is organized in rows and columns. Each column can contain a different type of data, such as numbers, strings, or dates.

### On the other hand, a pandas Series is a one-dimensional labeled array that can contain data of any type, such as integers, strings, or booleans. It is similar to a column in a DataFrame.

In [31]:
dict3 = {
    'Name' : ['Abhishek','Apurva','Ansh'],
    'Age' : [27,27,25],
    'Gender': ['Male','Female','Male'],
    'Department' : ['Developer','HR','Tester']
}

In [32]:
print(dict3)

{'Name': ['Abhishek', 'Apurva', 'Ansh'], 'Age': [27, 27, 25], 'Gender': ['Male', 'Female', 'Male'], 'Department': ['Developer', 'HR', 'Tester']}

In [33]:
df3 = pd.DataFrame(dict3)
print(df3)

       Name  Age  Gender Department
0  Abhishek   27    Male  Developer
1    Apurva   27  Female         HR
2      Ansh   25    Male     Tester

In [34]:
series3 = pd.Series(df3['Department'])
print(series3)

0    Developer
1           HR
2       Tester
Name: Department, dtype: object

<a id="5"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 5</p>

## Question 5: What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
---

In [35]:
# create sample dataframe with missing values
data5 = {'name': ['Abhishek', 'Aditi', 'Nitin', 'Bhushan', 'Kritika'],
        'age': [25, 30, None, 40, 35],
        'city': ['Pune', 'Mumbai', 'Delhi', None, 'Banaras'],
        'category': ['A', 'B', 'A', 'B', 'A'],
        'sales': [400, 200, 250, 150, 450],
        'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05']}
df5 = pd.DataFrame(data5)
df5

       name   age     city category  sales        date
0  Abhishek  25.0     Pune        A    400  2022-01-01
1     Aditi  30.0   Mumbai        B    200  2022-01-02
2     Nitin   NaN    Delhi        A    250  2022-01-03
3   Bhushan  40.0     None        B    150  2022-01-04
4   Kritika  35.0  Banaras        A    450  2022-01-05

## Drop NA

In [38]:
print(df5.isnull().sum())

name        0
age         1
city        1
category    0
sales       0
date        0
dtype: int64

In [36]:
df5.dropna()

       name   age     city category  sales        date
0  Abhishek  25.0     Pune        A    400  2022-01-01
1     Aditi  30.0   Mumbai        B    200  2022-01-02
4   Kritika  35.0  Banaras        A    450  2022-01-05

## Fill NA

In [39]:
df5.fillna(0)

       name   age     city category  sales        date
0  Abhishek  25.0     Pune        A    400  2022-01-01
1     Aditi  30.0   Mumbai        B    200  2022-01-02
2     Nitin   0.0    Delhi        A    250  2022-01-03
3   Bhushan  40.0        0        B    150  2022-01-04
4   Kritika  35.0  Banaras        A    450  2022-01-05

## groupby

In [40]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   age       4 non-null      float64
 2   city      4 non-null      object
 3   category  5 non-null      object
 4   sales     5 non-null      int64
 5   date      5 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 368.0+ bytes

In [44]:
df5.groupby(['city'])['sales'].mean()

city
Banaras    450.0
Delhi      250.0
Mumbai     200.0
Pune       400.0
Name: sales, dtype: float64

<a id="6"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 6</p>

## Question 6: Which of the following is mutable in nature Series, DataFrame, Panel?
---

## Answer:

### In pandas, Series and DataFrame are mutable in nature.

### Panel is considered immutable.

### That means, Series and DataFrame objects can be modified after they are created, and any changes made to them will be reflected in the original objects. On the other hand, Panel objects are generally not modified once created, and any changes made to them usually result in the creation of a new object.

### Note that while Series and DataFrame objects are mutable, it is generally recommended to avoid modifying them in place, as this can lead to unexpected results and errors. Instead, it is often better to create a new object with the desired modifications.

<a id="7"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 7</p>

## Question 7 : Create a DataFrame using multiple Series. Explain with an example.
---

## Answer:

### By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [45]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Data Science Masters","Java with DSA","Full Stack Web Development"])
fees = pd.Series([7000,7500,8000])
discount  = pd.Series([3500,3000,2500])

# concat() supports to combine multiple series.
df7=pd.concat([courses,fees,discount],axis=1)
df7.columns = ['course','fees','discount']
df7

                       course  fees  discount
0        Data Science Masters  7000      3500
1               Java with DSA  7500      3000
2  Full Stack Web Development  8000      2500